#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be created
  + resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "foreign-language-reader"
      + region         = "sfo2"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + tags           = [
          + "prod",
        ]
      + updated_at     = (known after apply)
      + version        = "1.16.6-do.0"

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 2
          + min_nodes         = 1
          + name              = "worker-pool"
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
        }
    }

  # module.infrastructure.module.container_registries.kubernetes_secret.kubernetes_user_secret will be created
  + resource "kubernetes_secret" "kubernetes_user_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "aws"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes will be destroyed
  - resource "digitalocean_database_firewall" "allow_kubernetes" {
      - cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id         = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e-20200229071705245300000001" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes_to_redis will be destroyed
  - resource "digitalocean_database_firewall" "allow_kubernetes_to_redis" {
      - cluster_id = "ed6d0b89-2536-4455-a2ea-56b157ed9bc4" -> null
      - id         = "ed6d0b89-2536-4455-a2ea-56b157ed9bc4-20200308052816996800000001" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_loadbalancer.foreign_language_reader will be destroyed
  - resource "digitalocean_loadbalancer" "foreign_language_reader" {
      - algorithm              = "round_robin" -> null
      - droplet_ids            = [] -> null
      - enable_proxy_protocol  = false -> null
      - id                     = "92f80e6c-bc55-4e08-88ab-a4cefa23346e" -> null
      - ip                     = "167.99.25.47" -> null
      - name                   = "adfa0fdc0872441b18eff7df2ab9a1c7" -> null
      - redirect_http_to_https = false -> null
      - region                 = "sfo2" -> null
      - status                 = "active" -> null
      - urn                    = "do:loadbalancer:92f80e6c-bc55-4e08-88ab-a4cefa23346e" -> null

      - forwarding_rule {
          - entry_port      = 80 -> null
          - entry_protocol  = "tcp" -> null
          - target_port     = 32524 -> null
          - target_protocol = "tcp" -> null
          - tls_passthrough = false -> null
        }
      - forwarding_rule {
          - entry_port      = 443 -> null
          - entry_protocol  = "tcp" -> null
          - target_port     = 32723 -> null
          - target_protocol = "tcp" -> null
          - tls_passthrough = false -> null
        }

      - healthcheck {
          - check_interval_seconds   = 3 -> null
          - healthy_threshold        = 5 -> null
          - port                     = 32524 -> null
          - protocol                 = "tcp" -> null
          - response_timeout_seconds = 5 -> null
          - unhealthy_threshold      = 3 -> null
        }

      - sticky_sessions {
          - cookie_ttl_seconds = 0 -> null
          - type               = "none" -> null
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_project.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_project" "foreign_language_reader" {
        created_at  = "2020-02-24T07:35:44Z"
        description = "Read text in different languages."
        environment = "Production"
        id          = "9c8405b7-e1c3-4397-a4a7-dbfce6a3cec7"
        name        = "foreign-language-reader"
        owner_id    = 1516704
        owner_uuid  = "1e34495ff67d4ea006257883b8e7c8c769bb687f"
        purpose     = "Web Application"
      ~ resources   = [
            "do:dbaas:9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e",
            "do:dbaas:ed6d0b89-2536-4455-a2ea-56b157ed9bc4",
            "do:domain:foreignlanguagereader.com",
          - "do:loadbalancer:92f80e6c-bc55-4e08-88ab-a4cefa23346e",
          - "do:volume:441c4ac0-656c-11ea-a5ff-0a58ac142136",
        ]
        updated_at  = "2020-02-29T07:19:30Z"
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.api will be destroyed
  - resource "digitalocean_record" "api" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "api.foreignlanguagereader.com" -> null
      - id       = "91351088" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.99.25.47" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.language will be destroyed
  - resource "digitalocean_record" "language" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "language.foreignlanguagereader.com" -> null
      - id       = "91361584" -> null
      - name     = "language" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.99.25.47" -> null
      - weight   = 0 -> null
    }

Plan: 2 to add, 1 to change, 5 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
